{
	"intents": [
		{
			"tag": "office_hours",
			"patterns": ["What are the office hours?", "When is the office open?", "Office working hours?"],
			"responses": ["Our office hours are from 9 AM to 6 PM, Monday through Friday."]
		},
		{
			"tag": "employee_handbook",
			"patterns": ["How do I find the employee handbook?", "Where is the employee handbook?", "Employee handbook location?"],
			"responses": ["You can find the employee handbook on the company intranet under the HR section."]
		},
		{
			"tag": "vacation_days",
			"patterns": ["How many vacation days do I have left?", "Vacation days remaining?", "Check my vacation days?"],
			"responses": ["You can check your remaining vacation days on the HR portal under 'My Leave Balance'. If you need further assistance, please contact HR."]
		},
		{
			"tag": "maternity_leave",
			"patterns": ["How do I apply for maternity leave?", "Maternity leave application?", "Apply for maternity leave?"],
			"responses": ["To apply for maternity leave, please fill out the maternity leave request form available on the HR portal and submit it to your manager for approval."]
		},
		{
			"tag": "payday",
			"patterns": ["When is the next payday?", "Next payday?", "Payday date?"],
			"responses": ["The next payday is on the last working day of the month."]
		},
		{
			"tag": "change_bank_details",
			"patterns": ["How do I change my bank account for salary deposits?", "Change bank account details?", "Update salary bank account?"],
			"responses": ["To change your bank account details, please update your information on the HR portal under 'Payroll Information' or contact the payroll department."]
		},
		{
			"tag": "injury_at_work",
			"patterns": ["What should I do if I get injured at work?", "Injury at work procedure?", "Work injury protocol?"],
			"responses": [
				"If you get injured at work, report the injury to your supervisor immediately and seek medical attention if necessary. Fill out an incident report form available on the HR portal."
			]
		},
		{
			"tag": "covid_protocols",
			"patterns": ["What are the COVID-19 protocols in the office?", "Office COVID-19 guidelines?", "COVID-19 safety measures?"],
			"responses": [
				"Please follow the COVID-19 protocols outlined in the health and safety section on the company intranet. This includes wearing masks, maintaining social distance, and regular hand sanitization."
			]
		},
		{
			"tag": "training_sessions",
			"patterns": ["Are there any upcoming training sessions?", "Training sessions schedule?", "Upcoming trainings?"],
			"responses": ["You can find the schedule for upcoming training sessions on the HR portal under 'Training Calendar'."]
		},
		{
			"tag": "professional_development",
			"patterns": ["How do I enroll in a professional development course?", "Enroll in development course?", "Professional development enrollment?"],
			"responses": ["To enroll in a professional development course, visit the 'Training and Development' section on the HR portal and select the course you're interested in."]
		},
		{
			"tag": "report_harassment",
			"patterns": ["How do I report workplace harassment?", "Report harassment?", "Workplace harassment complaint?"],
			"responses": ["To report workplace harassment, please contact the HR department directly or use the anonymous reporting tool available on the HR portal."]
		},
		{
			"tag": "file_grievance",
			"patterns": ["What is the process for filing a grievance?", "File a grievance?", "Grievance procedure?"],
			"responses": ["To file a grievance, please complete the grievance form available on the HR portal and submit it to the HR department. You will be contacted for a follow-up meeting."]
		},
		{
			"tag": "performance_review",
			"patterns": ["How do I access my performance review?", "Check my performance review?", "Performance review access?"],
			"responses": ["You can access your performance review on the HR portal under 'My Performance'. If you have any questions, please contact your manager."]
		},
		{
			"tag": "goal_setting",
			"patterns": ["What is the process for setting goals for the new quarter?", "Set goals for new quarter?", "New quarter goal setting?"],
			"responses": ["To set goals for the new quarter, use the goal-setting tool on the HR portal under 'Performance Management' and discuss them with your manager."]
		},
		{
			"tag": "employee_recognition",
			"patterns": ["How do I nominate someone for an employee recognition award?", "Nominate for recognition award?", "Employee recognition nomination?"],
			"responses": ["To nominate someone for an employee recognition award, fill out the nomination form on the HR portal under 'Employee Recognition'."]
		},
		{
			"tag": "performance_bonus",
			"patterns": ["What are the criteria for receiving a performance bonus?", "Criteria for performance bonus?", "Performance bonus requirements?"],
			"responses": [
				"The criteria for receiving a performance bonus include meeting or exceeding your performance goals, contributing to team success, and demonstrating company values. Details are available in the 'Compensation' section on the HR portal."
			]
		},
		{
			"tag": "remote_work_policy",
			"patterns": [
				"What are the responsibilities of employees or contractors when they plan to work from a location other than their base office?",
				"Responsibilities for remote work?",
				"Remote work obligations?"
			],
			"responses": [
				"Employees or contractors planning to work from any location other than their base office location will be considered as working from a remote location. They must notify management via email before relocating from their remote work location."
			]
		},
		{
			"tag": "notify_remote_work",
			"patterns": ["Who should they notify for remote work policy, and how?", "Remote work notification?", "Notify remote work policy?"],
			"responses": ["They need to send an email to both HR Support at hrsupport@pursuitsoftware.biz and Technical Support at techsupport@pursuitsoftware.biz."]
		},
		{
			"tag": "noncompliance_policy",
			"patterns": ["What happens if someone doesn't comply with this policy?", "Noncompliance consequences?", "Policy noncompliance action?"],
			"responses": ["Pursuit Software reserves the right to take appropriate disciplinary action for noncompliance with this policy."]
		},
		{
			"tag": "remote_work_equipment",
			"patterns": ["What equipment is required for remote work?", "Remote work equipment?", "Required equipment for remote work?"],
			"responses": [
				"A secure, up-to-date computer or laptop that meets our hardware and software requirements. Depending on job requirements, a company-issued or personal mobile device may be necessary for accessing corporate applications or for communication."
			]
		},
		{
			"tag": "internet_connectivity",
			"patterns": ["What about internet connectivity?", "Internet requirements for remote work?", "Remote work internet?"],
			"responses": [
				"Primary Internet connection should be your main source of connectivity during regular work hours and must have sufficient bandwidth to support work-related activities, such as video conferences, emails, and other online tools. In case your primary connection experiences downtime, a backup should be from a different service provider or a separate network to minimize the likelihood of simultaneous failures."
			]
		},
		{
			"tag": "certification_reimbursement",
			"patterns": ["What are the requirements for certification to be eligible for reimbursement?", "Certification reimbursement requirements?", "Eligible for certification reimbursement?"],
			"responses": ["For certification to be eligible for reimbursement, it must be done on the company's recommendation."]
		},
		{
			"tag": "initial_fees_payment",
			"patterns": ["Who pays for the certification or exam fees initially?", "Initial payment for certification?", "Certification fees payment?"],
			"responses": ["The employee must initially pay for the certification or exam fees."]
		},
		{
			"tag": "reimbursement_conditions",
			"patterns": ["What are the conditions for reimbursement?", "Certification reimbursement conditions?", "Conditions for getting reimbursed?"],
			"responses": [
				"To be eligible for reimbursement: 1. The employee must pass the certification exam. 2. If the employee fails the exam, they may take a second attempt. In this case, the reimbursement will be for the maximum of the two exam fees (either the first attempt or the retake). 3. If the employee fails the exam a second time, there will be no reimbursement for any attempt."
			]
		},
		{
			"tag": "fees_reimbursement_timeframe",
			"patterns": ["When will the fees be reimbursed?", "Reimbursement timeframe?", "Timeframe for fees reimbursement?"],
			"responses": ["The fees will be reimbursed 90 days after the date of certification."]
		},
		{
			"tag": "first_attempt_failure",
			"patterns": ["What happens if I fail the exam on my first attempt?", "Failing the exam on the first try?", "First attempt exam failure?"],
			"responses": [
				"If you fail the exam on your first attempt, you can take a second attempt. The reimbursement will cover the maximum of the two exam fees (either the first attempt or the retake)."
			]
		},
		{
			"tag": "second_attempt_failure",
			"patterns": ["And if I fail the second attempt?", "Failing the exam on the second try?", "Second attempt exam failure?"],
			"responses": ["If you fail the second attempt, there will be no reimbursement for any attempt."]
		},
		{
			"tag": "salary_increments",
			"patterns": ["I have a question about salary increments.", "Salary increment details?", "Information on salary increments?"],
			"responses": [
				"I understand that salary increments are an important topic. However, I’m not equipped to provide detailed information on that. I can connect you with our HR team who can assist you further."
			]
		}
	]
}
